samples/expression_tree_dot/mixed_2.dot
digraph expression {
  rankdir=TB;
  "node1" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node1"];
  "node2" [label = "XOR", fillcolor = "lightpink", style = "filled", name = "node2"];
  "node3" [label = "OR", fillcolor = "lightcoral", style = "filled", name = "node3"];
  "node4" [label = "x", fillcolor = "lightblue", style = "filled", name = "node4"];
  "node5" [label = "y", fillcolor = "lightblue", style = "filled", name = "node5"];
  "node6" [label = "u", fillcolor = "lightblue", style = "filled", name = "node6"];
  "node7" [label = "v", fillcolor = "lightblue", style = "filled", name = "node7"];
  "node1" -> "node2" [label = "L"];
  "node1" -> "node3" [label = "R"];
  "node2" -> "node4" [label = "L"];
  "node2" -> "node5" [label = "R"];
  "node3" -> "node6" [label = "L"];
  "node3" -> "node7" [label = "R"];
}
